; domain
(define (domain Domain1)

    (:requirements :strips)

    (:predicates
        (ROBOT ?t) (LOCATION ?l) 
        (BOXHEAVY ?b) (BOXLIGHT ?b)
        (conn ?l1 ?l2)
        (boxat ?b ?l) (boxon ?b ?t)
        (robotat ?t ?l)
        (free1 ?t) (full1 ?t)
        (free2 ?t) (full2 ?t)
        (boxdown ?b)
    )

    (:action move
        :parameters (?robot ?from ?to)
        :precondition (and 
            (ROBOT ?robot) (LOCATION ?from) (LOCATION ?to)
            (robotat ?robot ?from) (conn ?from ?to)
        )
        :effect (and(robotat ?robot ?to) (not(robotat ?robot ?from))
        )
    )
    
    (:action load1
        :parameters (?robot ?load ?location)
        :precondition (and
            (ROBOT ?robot) (LOCATION ?location) (BOXLIGHT ?load)
            (robotat ?robot ?location) (boxat ?load ?location)
            (free1 ?robot) (boxdown ?load)
        )
        :effect (and
            (not(free1 ?robot)) (not(boxat ?load ?location)) (full1 ?robot)
            (boxon ?load ?robot) (not(boxdown ?load))
        )
    )
    
    (:action load2
        :parameters (?robot ?load ?location)
        :precondition (and
            (ROBOT ?robot) (LOCATION ?location) (BOXLIGHT ?load)
            (robotat ?robot ?location) (boxat ?load ?location)
            (free2 ?robot) (boxdown ?load)
        )
        :effect (and
            (not(free2 ?robot)) (not(boxat ?load ?location)) (full2 ?robot)
            (boxon ?load ?robot) (not(boxdown ?load))
        )
    )
    
    (:action loadheavy
        :parameters (?robot ?load ?location)
        :precondition (and
            (ROBOT ?robot) (LOCATION ?location) (BOXHEAVY ?load)
            (robotat ?robot ?location) (boxat ?load ?location)
            (free2 ?robot) (free1 ?robot) (boxdown ?load)
        )
        :effect (and
            (not(free2 ?robot)) (not(boxat ?load ?location)) (full2 ?robot)
            (not(free1 ?robot)) (boxon ?load ?robot) (not(boxdown ?load))
            (full1 ?robot)
        )
    )
    
    (:action unload1
        :parameters (?robot ?load ?location)
        :precondition (and
            (ROBOT ?robot) (LOCATION ?location) (BOXLIGHT ?load)
            (robotat ?robot ?location) (boxon ?load ?robot)
            (full1 ?robot)
        )
        :effect (and
            (not(full1 ?robot)) (not(boxon ?load ?robot)) 
            (free1 ?robot) (boxat ?load ?location) (boxdown ?load)
        )
    )
    
    (:action unload2
        :parameters (?robot ?load ?location)
        :precondition (and
            (ROBOT ?robot) (LOCATION ?location) (BOXLIGHT ?load)
            (robotat ?robot ?location) (boxon ?load ?robot)
            (full2 ?robot)
        )
        :effect (and
            (not(full2 ?robot)) (not(boxon ?load ?robot)) 
            (free2 ?robot) (boxat ?load ?location) (boxdown ?load)
        )
    )
    
    (:action unloadheavy
        :parameters (?robot ?load ?location)
        :precondition (and
            (ROBOT ?robot) (LOCATION ?location) (BOXHEAVY ?load)
            (robotat ?robot ?location) (boxon ?load ?robot)
            (full2 ?robot)
        )
        :effect (and
            (not(full2 ?robot)) (not(full1 ?robot)) (not(boxon ?load ?robot)) 
            (free1 ?robot) (free2 ?robot) (boxat ?load ?location) 
            (boxdown ?load)
        )
    )
    
)

; problem
(define (problem Problem1)


    (:domain Domain1)
    
    (:objects   
        r1 r2 r3 r4
        robot
        boxlight1 boxlight2 boxheavy1 boxheavy2
    )
    
    (:init  
        (ROBOT robot)
        
        (BOXHEAVY boxheavy1) (BOXLIGHT boxlight1) 
        (BOXHEAVY boxheavy2) (BOXLIGHT boxlight2)
            
        (LOCATION r1) (LOCATION r2)
        (LOCATION r3) (LOCATION r4)
            
        (boxat boxheavy1 r2) (boxat boxlight1 r2)
        (boxat boxheavy2 r3) (boxat boxlight2 r3)
        
        (boxdown boxheavy1) (boxdown boxheavy2)
        (boxdown boxlight1) (boxdown boxlight2)
        
        (robotat robot r1) (free1 robot) (free2 robot)
        
        (conn r1 r2) (conn r2 r3) (conn r3 r4)
        (conn r2 r1) (conn r3 r2) (conn r4 r3)
    
    )
    
    (:goal (and 
        (boxat boxheavy1 r4) (boxat boxlight1 r4)
        (boxat boxheavy2 r4) (boxat boxlight2 r4)
        (boxdown boxheavy1) (boxdown boxlight1)
        (boxdown boxheavy2) (boxdown boxlight2))
    )
)

; plan
1. (move robot r1 r2)
   deleted: (robotat robot r1)
   added: (robotat robot r2)
   goals met: 4 of 8
2. (move robot r2 r3)
   deleted: (robotat robot r2)
   added: (robotat robot r3)
   goals met: 4 of 8
3. (load2 robot boxlight2 r3)
   deleted: (free2 robot) (boxat boxlight2 r3) (boxdown boxlight2)
   added: (full2 robot) (boxon boxlight2 robot)
   goals met: 3 of 8
4. (move robot r3 r4)
   deleted: (robotat robot r3)
   added: (robotat robot r4)
   goals met: 3 of 8
5. (unload2 robot boxlight2 r4)
   deleted: (full2 robot) (boxon boxlight2 robot)
   added: (free2 robot) (boxat boxlight2 r4) (boxdown boxlight2)
   goals met: 5 of 8
6. (move robot r4 r3)
   deleted: (robotat robot r4)
   added: (robotat robot r3)
   goals met: 5 of 8
7. (loadheavy robot boxheavy2 r3)
   deleted: (free2 robot) (boxat boxheavy2 r3) (free1 robot) (boxdown boxheavy2)
   added: (full2 robot) (boxon boxheavy2 robot) (full1 robot)
   goals met: 4 of 8
8. (move robot r3 r4)
   deleted: (robotat robot r3)
   added: (robotat robot r4)
   goals met: 4 of 8
9. (unloadheavy robot boxheavy2 r4)
   deleted: (full2 robot) (full1 robot) (boxon boxheavy2 robot)
   added: (free1 robot) (free2 robot) (boxat boxheavy2 r4) (boxdown boxheavy2)
   goals met: 6 of 8
10. (move robot r4 r3)
   deleted: (robotat robot r4)
   added: (robotat robot r3)
   goals met: 6 of 8
11. (move robot r3 r2)
   deleted: (robotat robot r3)
   added: (robotat robot r2)
   goals met: 6 of 8
12. (loadheavy robot boxheavy1 r2)
   deleted: (free2 robot) (boxat boxheavy1 r2) (free1 robot) (boxdown boxheavy1)
   added: (full2 robot) (boxon boxheavy1 robot) (full1 robot)
   goals met: 5 of 8
13. (move robot r2 r1)
   deleted: (robotat robot r2)
   added: (robotat robot r1)
   goals met: 5 of 8
14. (unloadheavy robot boxheavy1 r1)
   deleted: (full2 robot) (full1 robot) (boxon boxheavy1 robot)
   added: (free1 robot) (free2 robot) (boxat boxheavy1 r1) (boxdown boxheavy1)
   goals met: 6 of 8
15. (move robot r1 r2)
   deleted: (robotat robot r1)
   added: (robotat robot r2)
   goals met: 6 of 8
16. (load2 robot boxlight1 r2)
   deleted: (free2 robot) (boxat boxlight1 r2) (boxdown boxlight1)
   added: (full2 robot) (boxon boxlight1 robot)
   goals met: 5 of 8
17. (move robot r2 r3)
   deleted: (robotat robot r2)
   added: (robotat robot r3)
   goals met: 5 of 8
18. (move robot r3 r4)
   deleted: (robotat robot r3)
   added: (robotat robot r4)
   goals met: 5 of 8
19. (unload2 robot boxlight1 r4)
   deleted: (full2 robot) (boxon boxlight1 robot)
   added: (free2 robot) (boxat boxlight1 r4) (boxdown boxlight1)
   goals met: 7 of 8
20. (move robot r4 r3)
   deleted: (robotat robot r4)
   added: (robotat robot r3)
   goals met: 7 of 8
21. (move robot r3 r2)
   deleted: (robotat robot r3)
   added: (robotat robot r2)
   goals met: 7 of 8
22. (move robot r2 r1)
   deleted: (robotat robot r2)
   added: (robotat robot r1)
   goals met: 7 of 8
23. (loadheavy robot boxheavy1 r1)
   deleted: (free2 robot) (boxat boxheavy1 r1) (free1 robot) (boxdown boxheavy1)
   added: (full2 robot) (boxon boxheavy1 robot) (full1 robot)
   goals met: 6 of 8
24. (move robot r1 r2)
   deleted: (robotat robot r1)
   added: (robotat robot r2)
   goals met: 6 of 8
25. (move robot r2 r3)
   deleted: (robotat robot r2)
   added: (robotat robot r3)
   goals met: 6 of 8
26. (move robot r3 r4)
   deleted: (robotat robot r3)
   added: (robotat robot r4)
   goals met: 6 of 8
27. (unloadheavy robot boxheavy1 r4)
   deleted: (full2 robot) (full1 robot) (boxon boxheavy1 robot)
   added: (free1 robot) (free2 robot) (boxat boxheavy1 r4) (boxdown boxheavy1)
   goals met: 8 of 8
